# 01. Import Libraries

In [3]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [9]:
# Establishing a path

path = r'/Users/rkaran/Documents/careerfoundary/07-06-2024 Instacart Basket Analysis/02 Data'

In [7]:
print(path)

/Users/rkaran/Documents/careerfoundary/07-06-2024 Instacart Basket Analysis/02 Data

In [14]:
# Importing dataframe customers.csv
customers = pd.read_csv(os.path.join(path, 'Original Data', 'customers.csv'))

In [17]:
# Preview the newly imported dataframe 

customers.head(10)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

In [19]:
# Check the dimensions of the dataframe

customers.shape

(206209, 10)

In [21]:
# View descriptive statistics 

customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [23]:
# Check data types

customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

## Step 4 Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [26]:
# Rename the columns to establish uniformity
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [28]:
customers.rename(columns = {'Surnam' : 'surname'}, inplace = True)

In [30]:
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [32]:
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [34]:
customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [36]:
customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [38]:
# Check columns
customers.columns

Index(['user_id', 'first_name', 'surname', 'gender', 'state', 'age',
       'date_joined', 'n_dependants', 'marital_status', 'income'],
      dtype='object')

The columns have been successfully renamed and are now uniform and clear

In [41]:
customers.head(10)

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Cynthia,Noble,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Chris,Walton,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Joseph,Hickman,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Jeremy,Vang,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Shawn,Chung,Male,Virginia,26,1/1/2017,2,married,32072

## Step 5 Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [45]:
# Address data-types and potential mixed data-types in the dataframe

customers.dtypes

user_id            int64
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [47]:
# Checking for mixed data-types in each column

for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

first_name

In [49]:
# The output revealed that the 'first_name' column has mixed data-types that need to be addressed

customers['first_name'] = customers['first_name'].astype('str')

In [51]:
# The 'user_id' column, while not containing mixed data-types, is still improperly listed as an integer

customers['user_id'] = customers['user_id'].astype('str')

In [53]:
# Re-check the data-types in the data frame and for mixed data-types

customers.dtypes

user_id           object
first_name        object
surname           object
gender            object
state             object
age                int64
date_joined       object
n_dependants       int64
marital_status    object
income             int64
dtype: object

In [55]:
for col in customers.columns.tolist():
  weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

Now all columns are the appropriate data-types and no mixed data-types are present in any columns

In [60]:
# Check for missing data

customers.isnull().sum()

user_id           0
first_name        0
surname           0
gender            0
state             0
age               0
date_joined       0
n_dependants      0
marital_status    0
income            0
dtype: int64

In [62]:
# Check for full-duplicates

customers_dups = customers[customers.duplicated()]

In [64]:
customers_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, n_dependants, marital_status, income]
Index: []

In [66]:
# Perform a descriptive statistic check to ensure everything looks normal

customers.describe()

                 age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

## Step 6 Combine your customer data with the rest of your prepared Instacart data.

In [70]:
# Import the rest of the prepared Instacart data

orders_products = pd.read_pickle(os.path.join(path, 'Prepared Data', 'orders_products_combined_merged_new_variables_derived_aggregated.pkl'))

In [72]:
# Check the shape of the newly imported dataframe

orders_products.shape

(32406041, 23)

In [74]:
# Check the shape of the customers dataframe

customers.shape

(206209, 10)

In [76]:
# Identify a shared column

orders_products.head(5)

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,_merge,price_range_loc,busiest_days,busiest_period_of_day,max_order,loyalty_flag,average_spend,spender_flag,customer_frequency,frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,both,Mid-range product,Regularly busy,Most orders,32,Regular customer,6.935811,Low_spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,both,Mid-range product,Regularly busy,Average orders,32,Regular customer,6.935811,Low_spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,both,Mid-range product,Busiest days,Average orders,5,New customer,7.930208,Low_spender,7.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,both,Mid-range product,Slowest days,Most orders,3,New customer,4.972414,Low_spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,both,Mid-range product,Slowest days,Average orders,3,New customer,4.972414,Low_spender,9.0,Frequent customer

In [78]:
customers.head(5)

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [80]:
# Both dataframes share the 'user_id' column
# Check data-type of shared column

orders_products.dtypes['user_id']

dtype('int64')

In [82]:
customers.dtypes['user_id']

dtype('O')

In [84]:
# Make sure both key columns are the same data type

orders_products['user_id'] = orders_products['user_id'].astype('str')

In [86]:
orders_products.dtypes['user_id']

dtype('O')

The key columns now have matching data-types

In [89]:
# Drop the existing '_merge' column from previous exercises

orders_products = orders_products.drop(columns=['_merge'])

Merge the two dataframes using the column 'user_id' as the shared column with the default join (inner)

In [92]:
custs_ords_prods = orders_products.merge(customers, on = 'user_id', indicator = True)

This new dataframe combines both the customers and orders_products dataframes and uses the 'user_id' column as its key

In [95]:
# Check shape of newly merged dataframe

custs_ords_prods.shape

(32406041, 32)

In [97]:
custs_ords_prods.head(5)

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,first_name,surname,gender,state,age,date_joined,n_dependants,marital_status,income,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Deborah,Glass,Female,Vermont,66,6/16/2018,2,married,158302,both
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308,both

In [99]:
# Check inner join value counts

custs_ords_prods['_merge'].value_counts()

_merge
both          32406041
left_only            0
right_only           0
Name: count, dtype: int64

In [101]:
# Check data-types

custs_ords_prods.dtypes

product_id                   int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
order_id                     int64
user_id                     object
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
add_to_cart_order            int64
reordered                    int64
price_range_loc             object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
average_spend              float64
spender_flag                object
customer_frequency         float64
frequency_flag              object
first_name                  object
surname                     object
gender                      object
state                       object
age                          int64
date_joined                 object
n_dependants                 int64
marital_status              object
income                       int64
_merge                    category
dtype: object

In [103]:
# The 'order_id' column also has the wrong data type, so let's fix it

custs_ords_prods['order_id'] = custs_ords_prods['order_id'].astype('str')

In [105]:
custs_ords_prods.dtypes

product_id                   int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
order_id                    object
user_id                     object
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
add_to_cart_order            int64
reordered                    int64
price_range_loc             object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
average_spend              float64
spender_flag                object
customer_frequency         float64
frequency_flag              object
first_name                  object
surname                     object
gender                      object
state                       object
age                          int64
date_joined                 object
n_dependants                 int64
marital_status              object
income                       int64
_merge                    category
dtype: object

## Step 8 Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [108]:
custs_ords_prods.to_pickle(os.path.join(path, 'Prepared Data', 'orders_products_customers_merged_4.9.pkl'))